#### Terraform Plan `success`

<details><summary>Show plan</summary>

```
data.cloudflare_zone.main: Reading...
google_project_service.artifactregistry: Refreshing state... [id=simonandrews-ca-terraform/artifactregistry.googleapis.com]
google_project_service.iam: Refreshing state... [id=simonandrews-ca-terraform/iam.googleapis.com]
google_project_service.cloudresourcemanager: Refreshing state... [id=simonandrews-ca-terraform/cloudresourcemanager.googleapis.com]
google_project_service.run: Refreshing state... [id=simonandrews-ca-terraform/run.googleapis.com]
google_project_service.cloudbuild: Refreshing state... [id=simonandrews-ca-terraform/cloudbuild.googleapis.com]
data.cloudflare_zone.main: Read complete after 1s [id=d6d3d7657a16a8f5650abce88f4ce603]
google_service_account.terraform: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account.cloud_build: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-run@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions]
google_artifact_registry_repository.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/repositories/simonandrews-ca]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/serviceusage.serviceUsageAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/artifactregistry.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.builds.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.builds.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/run.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountUser"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.integrations.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.integrations.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/storage.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/storage.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_sa_user: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.main: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/4efc2732-2d98-4855-9ba3-c34c87091264]
google_cloudbuild_trigger.preview: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/43fb9c95-9879-40fc-8df1-1f8ef0970203]
google_project_iam_member.cloud_build_artifact_registry: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.writer/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_log_writer: Refreshing state... [id=simonandrews-ca-terraform/roles/logging.logWriter/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_run_admin: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloud_run_v2_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions/providers/github-actions]
google_service_account_iam_member.terraform_wif: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68732768207/locations/global/workloadIdentityPools/github-actions/attribute.repository/simon360/simonandrews.ca]
google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.apex_a will be created
  + resource "cloudflare_record" "apex_a" {
      + allow_overwrite = false
      + content         = "76.76.21.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.dkim_fm1 will be created
  + resource "cloudflare_record" "dkim_fm1" {
      + allow_overwrite = false
      + content         = "fm1.simonandrews.ca.dkim.fmhosted.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm1._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.dkim_fm2 will be created
  + resource "cloudflare_record" "dkim_fm2" {
      + allow_overwrite = false
      + content         = "fm2.simonandrews.ca.dkim.fmhosted.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm2._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.dkim_fm3 will be created
  + resource "cloudflare_record" "dkim_fm3" {
      + allow_overwrite = false
      + content         = "fm3.simonandrews.ca.dkim.fmhosted.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm3._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.dmarc will be created
  + resource "cloudflare_record" "dmarc" {
      + allow_overwrite = false
      + content         = "v=DMARC1;p=quarantine;pct=100;rua=mailto:0bad8dca8d@rua.easydmarc.eu;ruf=mailto:0bad8dca8d@ruf.easydmarc.eu;fo=1"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 900
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.google_verification will be created
  + resource "cloudflare_record" "google_verification" {
      + allow_overwrite = false
      + content         = "google-site-verification=wcIQ5jn3K_CdOmGOptHRf3AQz-N8N2yoOdtM5XaiBIM"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 900
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.lhr2 will be created
  + resource "cloudflare_record" "lhr2" {
      + allow_overwrite = false
      + content         = "68.183.45.149"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lhr2"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.lhr2_aaaa will be created
  + resource "cloudflare_record" "lhr2_aaaa" {
      + allow_overwrite = false
      + content         = "2a03:b0c0:1:e0::620:7001"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lhr2"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.lhr2_wildcard will be created
  + resource "cloudflare_record" "lhr2_wildcard" {
      + allow_overwrite = false
      + content         = "68.183.45.149"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*.lhr2"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.lhr2_wildcard_aaaa will be created
  + resource "cloudflare_record" "lhr2_wildcard_aaaa" {
      + allow_overwrite = false
      + content         = "2a03:b0c0:1:e0::620:7001"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*.lhr2"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.mx_1 will be created
  + resource "cloudflare_record" "mx_1" {
      + allow_overwrite = false
      + content         = "in1-smtp.messagingengine.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = 900
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.mx_2 will be created
  + resource "cloudflare_record" "mx_2" {
      + allow_overwrite = false
      + content         = "in2-smtp.messagingengine.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 20
      + proxiable       = (known after apply)
      + ttl             = 900
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.spf will be created
  + resource "cloudflare_record" "spf" {
      + allow_overwrite = false
      + content         = "v=spf1 include:spf.messagingengine.com -all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 900
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "cname.vercel-dns.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>